export default {
    en: {
        group: {
            data: "Data",
            appearance: "Appearance",
            interaction: "Interaction"
        },
        prop: {
            field: "Field",
            format: "Format",
            title: "Title",
            sortable: "Sortable",
            minWidth: "Min width",
            width: "Width"
        },
        tooltip: {
            format: "<p>For formatting numeric and currency values use:</p>" +
                "<code>0,0.0000</code> - число 10000 выведет в виде строки 10,000.0000 <br>" +
                "<code>0[.]00000</code> - число 10000.1234 выведет в виде строки 10000.12340 <br>" +
                "<code>($ 0.00 a)</code> - число 1230974 выведет в виде строки $ 1.23 m <br>" +
                "<p>Для форматирования даты и времени используйте доступные токены:</p>" +
                "<code>YY</code> - двучисловой год, например 01 <br>" +
                "<code>YYYY</code> - год в четырех цифрах, например 2001<br>" +
                "<code>M</code> - номер месяца начиная с 1, например 1-12<br>" +
                "<code>MM</code> - номер месяца в двух цифрах, например 01-12<br>" +
                "<code>MMM</code> - Сокращенное название месяца, например янв<br>" +
                "<code>MMMM</code> - Полное название месяца, например январь<br>" +
                "<code>D</code> - день, например 1-31 <br>" +
                "<code>DD</code> - день, с добавление ведущего нуля, например 01-31<br>" +
                "<code>H</code> - час в в 24 часах, наприме 1-23<br>" +
                "<code>HH</code> - час с добавление ведущего нуля, например 01-23<br>" +
                "<code>hh</code> - час с добавление ведущего нуля, например 01-12<br>" +
                "<code>m</code> - минут,например 0-59<br>" +
                "<code>mm</code> - минут, два числа, например 00-59<br>" +
                "<code>s</code> - секунд,например 0-59<br>" +
                "<code>ss</code> - секунд, два числа,например 00-59<br>" +
                "<code>m</code> - минут,например 0-59<br>" +
                "<code>SSS</code> - миллисекунды,например 000-999<br>" +
                "<code>Z</code> - смещение относительно UTC, например -05:00<br>"
        },
        other: {
            newColumn: "New column"
        }
    },
    ru: {
        group: {
            data: "Данные",
            appearance: "Внешний вид",
            interaction: "Взаимодействие"
        },
        prop: {
            field: "Поле",
            format: "Формат",
            title: "Заголовок",
            sortable: "Сортировка",
            minWidth: "Мин ширина",
            width: "Ширина"
        },
        tooltip: {
            format: "<p>Для форматирования чисел и денег используйте:</p>" +
                "<code>0,0.0000</code> - число 10000 выведет в виде строки 10,000.0000 <br>" +
                "<code>0[.]00000</code> - число 10000.1234 выведет в виде строки 10000.12340 <br>" +
                "<code>($ 0.00 a)</code> - число 1230974 выведет в виде строки $ 1.23 m <br>" +
                "<p>Для форматирования даты и времени используйте доступные токены:</p>" +
                "<code>YY</code> - двучисловой год, например 01 <br>" +
                "<code>YYYY</code> - год в четырех цифрах, например 2001<br>" +
                "<code>M</code> - номер месяца начиная с 1, например 1-12<br>" +
                "<code>MM</code> - номер месяца в двух цифрах, например 01-12<br>" +
                "<code>MMM</code> - Сокращенное название месяца, например янв<br>" +
                "<code>MMMM</code> - Полное название месяца, например январь<br>" +
                "<code>D</code> - день, например 1-31 <br>" +
                "<code>DD</code> - день, с добавление ведущего нуля, например 01-31<br>" +
                "<code>H</code> - час в в 24 часах, наприме 1-23<br>" +
                "<code>HH</code> - час с добавление ведущего нуля, например 01-23<br>" +
                "<code>hh</code> - час с добавление ведущего нуля, например 01-12<br>" +
                "<code>m</code> - минут,например 0-59<br>" +
                "<code>mm</code> - минут, два числа, например 00-59<br>" +
                "<code>s</code> - секунд,например 0-59<br>" +
                "<code>ss</code> - секунд, два числа,например 00-59<br>" +
                "<code>m</code> - минут,например 0-59<br>" +
                "<code>SSS</code> - миллисекунды,например 000-999<br>" +
                "<code>Z</code> - смещение относительно UTC, например -05:00<br>"

        },
        other: {
            newColumn: "Новая колонка"
        }
    }
}